app/views/questions/_question.html.erb

SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 6]]
---

  - <%= pluralize(question.answers.count, 'answer') %>