app/views/questions/show.html.erb

SELECT 1 AS one FROM "answers" WHERE "answers"."question_id" = ? LIMIT 1  [["question_id", 7]]
---

  <% if @question.answers.any? %>