app/controllers/answers_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "7"]]
INSERT INTO "answers" ("body", "created_at", "question_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "katana"], ["created_at", Wed, 28 May 2014 14:52:21 UTC +00:00], ["question_id", 7], ["updated_at", Wed, 28 May 2014 14:52:21 UTC +00:00], ["user_id", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 7]]
---
  def create
  	@question = Question.find(params[:question_id])
  	@answer = @question.answers.build(answer_create_params)
  	@answer.user = current_user

  	if @answer.save
  	  flash[:answer] = 'Your answer has been posted.'
  	  redirect_to @question
  	else
  	  @question = Question.find(params[:question_id])