app/controllers/questions_controller.rb

  def create
  	@question = current_user.questions.build(question_create_params)
  	if @question.save
---
INSERT INTO "questions" ("body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["body", "What is your favorite book?"], ["created_at", Sun, 25 May 2014 16:37:17 UTC +00:00], ["updated_at", Sun, 25 May 2014 16:37:17 UTC +00:00], ["user_id", 2]]

  def edit
    @question = current_user.questions.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."user_id" = ? AND "questions"."id" = ? LIMIT 1  [["user_id", 3], ["id", "7"]]

  def update
    @question = current_user.questions.find(params[:id])
    if @question.update(question_update_params)
---
SELECT "questions".* FROM "questions" WHERE "questions"."user_id" = ? AND "questions"."id" = ? LIMIT 1  [["user_id", 1], ["id", "6"]]
UPDATE "questions" SET "body" = ?, "updated_at" = ? WHERE "questions"."id" = 6  [["body", "How to be super happy?"], ["updated_at", Tue, 27 May 2014 15:49:23 UTC +00:00]]